In [28]:
import numpy as np
import pandas as pd
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split

In [29]:
df=pd.read_csv('cars.csv')

In [30]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [31]:
counts=df['brand'].value_counts()
threshold=100

In [32]:
repl=counts[counts<=threshold].index
df['brand']=df['brand'].replace(repl,'uncommon')

In [35]:
x_train,x_test,y_train,y_test=train_test_split(df.drop('selling_price',axis=1),df['selling_price'],test_size=0.2,random_state=0)

In [36]:
x_train

           brand  km_driven    fuel         owner
3042     Hyundai      60000     LPG   First Owner
1520        Tata     150000  Diesel   Third Owner
2611     Hyundai     110000  Diesel  Second Owner
3544    Mahindra      28000  Diesel  Second Owner
4138      Maruti      15000  Petrol   First Owner
...          ...        ...     ...           ...
4931        Tata      70000  Diesel   Third Owner
3264        Ford     100000  Diesel  Second Owner
1653     Hyundai      90000  Petrol  Second Owner
2607  Volkswagen      90000  Diesel   First Owner
2732     Hyundai     110000  Petrol   First Owner

[6502 rows x 4 columns]

In [44]:
transformer=ColumnTransformer(transformers=[('tnf1',OneHotEncoder(sparse_output=False,drop='first',dtype=np.int32),['brand','fuel','owner'])],remainder='passthrough')

In [45]:
transformer.fit_transform(x_train)

array([[     0,      0,      0, ...,      0,      0,  60000],
       [     0,      0,      0, ...,      0,      1, 150000],
       [     0,      0,      0, ...,      0,      0, 110000],
       ...,
       [     0,      0,      0, ...,      0,      0,  90000],
       [     0,      0,      0, ...,      0,      0,  90000],
       [     0,      0,      0, ...,      0,      0, 110000]], dtype=int64)

In [46]:
transformer.transform(x_test)

array([[    0,     0,     0, ...,     0,     0, 40000],
       [    0,     0,     0, ...,     0,     0, 70000],
       [    0,     0,     0, ...,     0,     0,  5000],
       ...,
       [    0,     0,     0, ...,     0,     0, 40000],
       [    0,     0,     0, ...,     0,     0,  2350],
       [    0,     0,     0, ...,     0,     0, 80000]], dtype=int64)